# RoomActualPowerLoadPerAreaParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomActualPowerLoadPerAreaParam Property
ParameterTypeId Class See Also
---
"Actual Power Load per area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomActualPowerLoadPerAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomActualPowerLoadPerAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomActualPowerLoadPerAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace